Revit 2027 API
AnnotationLabel Properties
The AnnotationLabel type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BaseDirection |  Direction of the base line of the text element.
(Inherited from TextElement)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
Coord |  Position of the text (in model coordinates.)
(Inherited from TextElement)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Height |  Height of the area of the text content.
(Inherited from TextElement)
HorizontalAlignment |  Horizontal alignment of the text content within the text area of the element.
(Inherited from TextElement)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTextWrappingActive
 A flag identifying whether text-wrapping is currently active in this text element or not.
 If text wrapping is active the width of the text box remains constant and the text will wrap. The height of the text box will automatically adjust to accomodate the height of the text.
 If text wrapping is not active the text does not wrap and the width of the text box adjusts with the width of the longest line of text. As the text width changes, the position of the text may change depending on the HorizontalAlignment
(Inherited from TextElement)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
KeepRotatedTextReadable |  A flag to control how text behaves inside a rotated text element.
(Inherited from TextElement)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
Symbol | Get the type of the TextElement object.
(Inherited from TextElement)
Text |  The content of the element as a plain string stripped of all formating.
(Inherited from TextElement)
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
UpDirection |  Direction along the vertical axis of letters of the text note.
(Inherited from TextElement)
UseNonBreakingSpaces |  If non-breaking spaces should be used in the label text.
VersionGuid |  Get the element version Guid.
(Inherited from Element)
VerticalAlignment |  Vertical alignment of the text.
(Inherited from TextElement)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
Width |  Width of the area of the text content.
(Inherited from TextElement)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
AnnotationLabel Class
Autodesk.Revit.DB Namespace